# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [3]:
print(a)
type(a)

0    100
1    200
2    300
3    400
dtype: int64

pandas.core.series.Series

Using indexing access the element 300 from the series a.

In [4]:
Element_300 = a[2]
print(Element_300)

300

What are the values of index for series a?

In [5]:
index_a = a.index
index_a

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a.index = ['c', 'a', 'b', 'd']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
d_value = a['d']
d_value

400

Sort the values wrt to the index and print it

In [8]:
sort_index = a.sort_index()
sort_index

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
 b = pd.DataFrame({'index': ['e','f','g'],
                 'value': [800,450,100]})
b.set_index('index', inplace=True)


b

       value
index
e        800
f        450
g        100

Append b series at the end of a series

In [10]:
a_append = pd.concat([a,b['value']])
a = a_append

In [11]:
#print a again after appending b into it

print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
sort_value_a =  a.sort_values(ascending=False)
sort_value_a
#sort_value_a.index

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [13]:
 df = pd.Series(a)

In [14]:
df.shape

(7,)

What is the shape of the datafarme <br>
(also, what does it imply?)

In [15]:
# 4 rows and 2 columns

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [16]:
# yep its same as the series.
df.index

Index(['c', 'a', 'b', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [17]:
df.head()
df.tail()

b    300
d    400
e    800
f    450
g    100
dtype: int64

In [18]:
# df_a.head() gives first 5 rows from the data frame
# df_a.tail() gives last 5 rows from the data frame

Rename the column of the dataframe as 'points'

In [19]:

df.columns = ['index', 'points']

df

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [20]:
#Create fruits array

fruits = pd.Series(["orange", "mango", "apple","orange", "mango", "apple","mango"])

fruits

0    orange
1     mango
2     apple
3    orange
4     mango
5     apple
6     mango
dtype: object

In [21]:
#Create series fruits out of fruits array

fruits_array = np.array(["orange", "mango", "apple","orange", "mango", "apple","mango"])
fruits_array

array(['orange', 'mango', 'apple', 'orange', 'mango', 'apple', 'mango'],
      dtype='<U6')

Change the index of fruits to the index of dataframe df

In [22]:
fruits.index = df.index

fruits

c    orange
a     mango
b     apple
d    orange
e     mango
f     apple
g     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [23]:

fruits = pd.DataFrame({"fruits": ["orange", "mango", "apple","orange", "mango", "apple","mango"]})
fruits

   fruits
0  orange
1   mango
2   apple
3  orange
4   mango
5   apple
6   mango

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [24]:
d1 = pd.DataFrame({"city" :['Chandigarh', "Delhi", "Kanpur", "Chennai", "Manali" ],
                  "Temperature" : [15, 22, 20, 26,-2]})

Print(d1)

In [25]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [26]:
d1.shape

(5, 2)

Set city = d1['city']

In [27]:
d1['city']

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

print city <br>
What is the type of city.

In [28]:
print(d1['city'])
type(d1['city'])

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

pandas.core.series.Series

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [29]:
 d2 = pd.DataFrame({'city' : ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
'Temperature' : [24,35,36,39]})

print the shape of this dataframe

In [30]:
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

merge the two dataframes together, save it in a new dataframe named 'd3'

In [31]:
d3 = pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [32]:
d3[d3["Temperature"] <= 20]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [33]:

d3[d3["Temperature"] >= 35]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
 HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [34]:
# write function here

def is_ut(city):
    if city in ['Chandigarh', 'Pondicherry', 'Delhi']:
        return True
    else:
        return False
    
d3['is_ut'] = d3['city'].apply(is_ut)

print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

In [35]:
#print(d3)

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [36]:
# write function here
def c_to_f(Temperature):
    temp_fahrenheit = (9/5) * Temperature + 32
    return temp_fahrenheit
    #print(str(Temperature) +" celsius is " + str(temp_fahrenheit) + " in Fahrenheit" )

c_to_f(10)


d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

In [37]:
# check function c_to_f(10)

In [38]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3["temp_fahrenheit"] = d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_fahrenheit
0   Chandigarh           15   True             59.0
1        Delhi           22   True             71.6
2       Kanpur           20  False             68.0
3      Chennai           26  False             78.8
4       Manali           -2  False             28.4
0    Bengalaru           24  False             75.2
1   Coimbatore           35  False             95.0
2    Srirangam           36  False             96.8
3  Pondicherry           39   True            102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [39]:
# Assuming 'is_ut' is a column indicating whether a city is a union territory in DataFrame d1
union_territories = d3[d3['is_ut']]['city']

print(union_territories)

0     Chandigarh
1          Delhi
3    Pondicherry
Name: city, dtype: object

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [40]:
Temp_90 = d3[d3['temp_fahrenheit']>90]['city']

Temp_90

1     Coimbatore
2      Srirangam
3    Pondicherry
Name: city, dtype: object

Select only the first three rows of the dataframe d1.

In [41]:
d3.head(3)

         city  Temperature  is_ut  temp_fahrenheit
0  Chandigarh           15   True             59.0
1       Delhi           22   True             71.6
2      Kanpur           20  False             68.0

Select all the rows and last two columns in the dataframe.

In [42]:
d3.iloc[:, -2:]

   is_ut  temp_fahrenheit
0   True             59.0
1   True             71.6
2  False             68.0
3  False             78.8
4  False             28.4
0  False             75.2
1  False             95.0
2  False             96.8
3   True            102.2

## Groupby

In [43]:
# Create a dataframe using dictionary of your choice

 
data = {
    'Name': ['John', 'Alice', 'Bob', 'Emily', 'Michael', 'Sophia'],
    'Age': [25, 30, 25, 40, 35, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'San Francisco', 'New York', 'Los Angeles'],
    'Salary': [50000, 60000, 55000, 70000, 65000, 60000]
}
df = pd.DataFrame(data)

In [44]:
# Use Groupby of single column with aggregate sum()
agg_sum = df.groupby('Age').sum()
print(agg_sum)

            Name                    City  Salary
Age
25       JohnBob         New YorkChicago  105000
30   AliceSophia  Los AngelesLos Angeles  120000
35       Michael                New York   65000
40         Emily           San Francisco   70000

In [45]:
# Use Groupby of single column with aggregate count()

agg_count = df.groupby('Age').count()

print(agg_count)

     Name  City  Salary
Age
25      2     2       2
30      2     2       2
35      1     1       1
40      1     1       1

In [46]:
# Use Groupby of single column with aggregate min() and max()
min_age = df.groupby('Age').min()

#print(min_age)
max_age = df.groupby('Age').max()

print(max_age)

        Name           City  Salary
Age
25      John       New York   55000
30    Sophia    Los Angeles   60000
35   Michael       New York   65000
40     Emily  San Francisco   70000

In [48]:
# Use Groupby of any 2 columns with aggregate mean()

agg_mean = df.groupby(['Age', 'Salary']).mean(numeric_only=True)

print(agg_mean)

Empty DataFrame
Columns: []
Index: [(25, 50000), (25, 55000), (30, 60000), (35, 65000), (40, 70000)]

In [ ]:
# Use Groupby of any 2 columns with aggregate min() and max()

agg_min = df.groupby(['Age', 'City']).min()

print(agg_min)

In [ ]:
agg_max = df.groupby(['Age', 'City']).max()

print(agg_max)

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [49]:
a = pd.date_range(start='2020-01-01', end='2021-04-01')

print a

In [50]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [51]:
len(a)

457

What is the type of a?

In [53]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex